{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2024-12-01T16:44:20.265537Z",
     "start_time": "2024-12-01T16:44:20.249773Z"
    }
   },
   "source": [
    "from py2neo import Graph, Node, Relationship, NodeMatcher\n",
    "\n",
    "URL = \"neo4j://localhost:7687\"\n",
    "AUTH = (\"neo4j\", \"neo4j123456\")\n",
    "graph = Graph(URL, auth=AUTH, name='neo4j')\n",
    "matcher = NodeMatcher(graph)"
   ],
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-12-01T16:54:59.674265Z",
     "start_time": "2024-12-01T16:54:59.648352Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# 查询所有标签\n",
    "query = \"CALL db.labels() YIELD label RETURN label\"\n",
    "result = graph.run(query)\n",
    "\n",
    "# 提取标签并打印\n",
    "labels = [record[\"label\"] for record in result]\n",
    "print(\"Labels in Neo4j:\", labels)"
   ],
   "id": "7e36b63ecd57b080",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Labels in Neo4j: ['Entity', 'Person', 'MagicalCreature', 'Object', 'Place', 'Miscellaneous', 'Event', 'Document', 'Organisation', 'House', 'Spell', 'QuidditchTeam', 'Potion', 'Organization', 'Creature', 'Time', 'Class', 'Position', 'Animal', 'Vehicle', 'Harry Potter', 'Letter', 'Uncle Vernon', 'Dudley', 'Postman', 'Sleeping bag', 'Aunt Petunia', 'Post Office', 'Food Processor', 'Milkman', 'Dairy', 'Minerva McGonagall', 'Hogwarts School of Witchcraft and Wizardry', 'Currency', 'Harry', 'Gringotts', 'Dumbledore', 'Goblins', 'Hogwarts', 'Sport', 'Dursleys', 'Hedwig', 'Hagrid', \"King's Cross\", 'Guard', 'Group', 'Title', 'Ghost', 'Cat', 'Corridor', 'Plant', 'Team', 'Broomstick', 'Mirror', 'Crowd of people', 'Woman', 'Tall, thin, black haired man', 'Family', 'Document/Artifact', 'Lord Voldemort', 'Muggle', 'Book', 'Mandrake', 'Plant Pot', 'Earmuffs', 'House Elf', 'Location', 'Ministry', 'Dwarf', 'Subject', 'Ron Weasley', 'Hermione Granger', 'George Weasley', 'Dudley Dursley', 'Hogwarts Express', 'A History of Magic by Bathilda Bagshot', 'Witch Burning in the Fourteenth Century Was Completely Pointless discuss', 'Witch', 'Wizard', 'Spellbook', 'Wand', 'Cauldron', 'Essay', 'Pillowcase', 'Flashlight', 'A History of Magic', 'Quill', 'Ink', 'Window', 'Boy', 'Ministry of Magic', 'Minister of Magic', 'Innkeeper', 'Dementor', 'Boggart', 'None', 'Nimbus', 'Dementors', 'Snitch', 'Ground', 'Map', 'Passageway', 'Cellar', 'Trapdoor', 'Wooden staircase', \"Woman's voice\", 'Man', 'Honeydukes', 'Hogwarts students', 'Jelly Slugs', 'Black', 'Committee', 'Food', 'Buckbeak', 'Scabbers', 'Pumpkin patch', 'Castle', 'Sirius', 'Ron', 'Hermione', 'Lupin', 'Werewolf', 'Professor Lupin', 'Picture', 'Pettigrew', 'James', 'Unicorn', 'Minister', 'Order of Merlin', 'Defense Against the Dark Arts teacher', 'Patronus', 'Invisibility Cloak', \"Marauder's Map\", 'Hogsmeade', 'owl', 'Scar', 'Glasses', 'Bedroom', 'Wormtail', 'Old man', 'Pain', 'Voldemort', 'Curse', 'Quidditch World Cup', 'Fred and George Weasley', 'Artifact', 'Magical Creature/Object', 'Event/Object', 'Veela', 'Fred', 'George', 'Charlie', 'Ginny', 'Mr Weasley', 'Irish', 'Krum', 'Bill', 'Rita Skeeter', 'Mr. Weasley', 'Mr Crouch', 'Arthur Weasley', 'Platform', 'Planet', 'Spider', 'Material', 'Activity', 'HouseElf', 'Professor Dumbledore', 'House-elf', 'Professor McGonagall', 'Girl', 'Table', 'Egg', 'MagicalObject', 'Water', 'Flipper', 'Darkness', 'Fish', 'Log', 'Weed', 'Something', 'Snape', 'Truth Potion', 'Dobby', 'Sirius Black', 'Cho Chang', 'Alastor Moody', 'Tree', 'Sphinx', 'Dagger', 'Death Eaters', 'Death Eater', 'Golden thread', 'Bungy', 'Mundungus Fletcher', 'Mr Tibbies', 'Mrs Figg', \"Harry's mother\", 'Uncle Vernon Dursley', 'Owls', 'Flying Ford Anglia', 'Marge', 'Pigwidgeon', 'Drink', 'Mrs. Weasley', 'Fred Weasley', 'Ginny Weasley', 'Mistress', 'Mudblood', 'Kreacher', 'Mundungus', 'Ministry official', 'Department', 'Division', 'Office', 'Bureau', 'Squad', 'Headquarters', 'Auror cubicles', 'Courtroom Ten', 'Goblet', 'Bode', 'Galleon', 'Moody', 'Dark wizard', 'Professor Umbridge', 'Gryffindor Quidditch team', 'Tablecloth', 'Detention', 'Tryouts', 'Punishment', 'Professor Grubbly Plank', 'Lachlan the Lanky', 'Cleansweep Eleven', 'Establishment', 'Fawkes', \"Harry's Mother\", 'Dummy', 'Shoes', 'Jinx', 'Sign', 'Weasley party', 'Floor guide', 'Floor', 'Magical creature', 'Blood Replenishing Potion', 'Healers', \"Ron's mum\", 'Knight Bus', 'Privet Drive', 'Christmas', 'Healer', 'Janus Thickey ward', 'Neville', 'Group/Organization', 'Professor', 'Shop', 'Luna Lovegood', 'Magazine', 'Authority', 'Memory', 'Malfoy', 'Slytherin', 'Miss Parkinson', 'Student', 'TimePeriod', 'Crowd', 'Garroting Gas', \"Umbridge's office door\", 'Umbridge', 'Department of Mysteries', 'Aragog', 'Forest', 'Thestral', 'Telephone Box', 'Security Desk', 'Atrium', 'Luna', 'Security Man', 'Dark Lord (Voldemort)', 'Prophecy', 'Lucius Malfoy', 'Dark Lord', 'Emotion', 'Fang', 'People', 'Trunk', 'Prime Minister', 'Fudge', 'Brockdale Bridge', 'Bones and Vance murders', 'ruckus in the West Country', 'Former Prime Minister', 'Private Secretary', 'Wall', 'Serious Black', 'You Know Who', 'Azkaban', \"Black's prison\", 'He Who Must Not Be Named', 'Herbert Chorley', \"St. Mungo's Hospital for Magical Maladies and Injuries\", 'Slughorn', 'Lily Evans', 'Bill Weasley', 'Product', 'Auror', 'Magical Creature', 'Great Hall', 'Gryffindor table', 'MagicalCreature/Object', 'MagicalConcept', 'Language', 'Concept', 'Law', 'Spell/Antidote', 'House-Elf', 'MagicalConcoction', 'Number', 'Horcrux', 'Nickname', 'Liquid', 'Dark Mark', 'Enchantment', 'Phoenix', \"Dumbledore's Army\", 'Centaur', 'Merpeople', 'MagicalGroup', 'Tonks', 'Mrs Weasley', 'Human being', 'Sword', \"Ron Weasley's soul\", 'Soul', 'Diary', \"Voldemort's soul\", \"Ginny Weasley's soul\", \"Person's emotions\", 'Ring', \"Dumbledore's method of destruction\", 'Norberta', 'Madame Delacour', 'MagicalItem', 'Tool', 'Room', 'Prophet', \"Regulus's Locket\", 'Cloak', \"Merlin's most baggy Y Fronts\", 'MagicalMaintenance', 'Telescope', 'Magical Eyeball', 'Desk', 'Filing Cabinet', \"Mr Weasley's File\", 'Undesirable Number One', 'Poster', 'Kitten', 'Dungeon door', 'Half-blood', 'Perkins', 'Symbol', 'Deathstick', 'Elder Wand', 'Resurrection Stone', 'Cedric', 'Peverell bloke', \"Nature's Nobility : A Wizarding Genealogy\", 'Program', 'Department of Magical Accidents and Catastrophes', \"Gryffindor's sword\", 'Goblin-made object', 'Propheti', 'Elf', 'Hallows', 'Goblin', 'Dragon', 'Clankers', 'Barman', 'Seamus', 'Statue', 'Potions book', 'Room of Requirement', 'Neville Longbottom', 'Thing', 'Unknown attacker', 'Horcruxes', 'Pouch', 'Clothes', 'Robes']\n"
     ]
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-12-01T16:44:21.107279Z",
     "start_time": "2024-12-01T16:44:21.101300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "file_path = 'data/duiqi.txt'\n",
    "with open(file_path, 'r', encoding='utf-8') as file:\n",
    "    lines = file.readlines()\n"
   ],
   "id": "21b7451425956c32",
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-12-01T16:44:23.370217Z",
     "start_time": "2024-12-01T16:44:23.355584Z"
    }
   },
   "cell_type": "code",
   "source": "lines[:10]",
   "id": "2d3e735764d45f7b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Mrs Dursley: Petunia=Mrs Dursley=Aunt Petunia\\n',\n",
       " 'Professor McGonagall: Professor McGonagall=McGonagall=Minerva McGonagall\\n',\n",
       " 'Lily: Lily=Mrs Potter=Lily Potter\\n',\n",
       " 'Professor Dumbledore: Professor Dumbledore=Dumbledore=Albus Dumbledore\\n',\n",
       " 'Hagrid: Rubeus Hagrid=Hagrid\\n',\n",
       " 'James Potter: James Potter=Mr Potter\\n',\n",
       " 'Harry Potter: Harry=Harry Potter\\n',\n",
       " 'Dudley Dursley: Dudley Dursley=Dudley\\n',\n",
       " 'Vernon Dursley: Dursley=Mr Dursley=Uncle Vernon\\n',\n",
       " 'Mr and Mrs Dursley: Aunt and uncle=Mr and Mrs Dursley=Dursleys\\n']"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-12-01T17:11:36.998802Z",
     "start_time": "2024-12-01T17:11:11.475402Z"
    }
   },
   "cell_type": "code",
   "source": [
    "len_lines = len(lines)-1\n",
    "for index,line in enumerate(lines):\n",
    "    print(f'{index}/{len_lines}')\n",
    "    line = line.strip()\n",
    "    need_name,merge_str = line.split(': ')\n",
    "    merge_name_list = merge_str.split('=')\n",
    "    for merge_name in merge_name_list:\n",
    "        for label in labels:\n",
    "            a_node = matcher.match(label, name=need_name).first()\n",
    "            b_node = matcher.match(label, name=merge_name).first()\n",
    "            if not a_node and not b_node:\n",
    "                continue\n",
    "            if a_node and b_node:\n",
    "                print(f\"Merging {label}: {need_name} and {label}: {merge_name}\")\n",
    "                query = f\"\"\"\n",
    "                        MATCH (a:`{label}` {{name: \"{need_name}\"}}), (b:`{label}` {{name: \"{merge_name}\"}})\n",
    "                        CALL apoc.refactor.mergeNodes([a, b], {{properties: \"overwrite\", mergeRels: true}}) YIELD node\n",
    "                        RETURN node\n",
    "                        \"\"\"\n",
    "                print(query)\n",
    "                graph.run(query)\n",
    "            elif b_node:\n",
    "                print(f\"rename {label}: {merge_name} to {label}: {need_name}\")\n",
    "                query = f\"\"\"\n",
    "                        MATCH (a:`{label}` {{name: \"{merge_name}\"}}) set a.name = \"{need_name}\"\n",
    "                        \"\"\"\n",
    "                print(query)\n",
    "                graph.run(query)\n",
    "            else:\n",
    "                print('未匹配到！')\n",
    "            print('*****************************************')\n",
    "        print('=========================================')\n",
    "print('对齐实体完成！')"
   ],
   "id": "f9da094c5cea2e6a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0/41\n",
      "Merging Person: Mrs Dursley and Person: Petunia\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Mrs Dursley\"}), (b:`Person` {name: \"Petunia\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "=========================================\n",
      "rename Person: Aunt Petunia to Person: Mrs Dursley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Aunt Petunia\"}) set a.name = \"Mrs Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Aunt Petunia: Aunt Petunia to Aunt Petunia: Mrs Dursley\n",
      "\n",
      "                        MATCH (a:`Aunt Petunia` {name: \"Aunt Petunia\"}) set a.name = \"Mrs Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "1/41\n",
      "Merging Person: Professor McGonagall and Person: Professor McGonagall\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor McGonagall\"}), (b:`Person` {name: \"Professor McGonagall\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Professor McGonagall and MagicalCreature: Professor McGonagall\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Professor McGonagall\"}), (b:`MagicalCreature` {name: \"Professor McGonagall\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Professor McGonagall: Professor McGonagall and Professor McGonagall: Professor McGonagall\n",
      "\n",
      "                        MATCH (a:`Professor McGonagall` {name: \"Professor McGonagall\"}), (b:`Professor McGonagall` {name: \"Professor McGonagall\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor McGonagall and Person: McGonagall\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor McGonagall\"}), (b:`Person` {name: \"McGonagall\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Minerva McGonagall to Person: Professor McGonagall\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Minerva McGonagall\"}) set a.name = \"Professor McGonagall\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Minerva McGonagall: Minerva McGonagall to Minerva McGonagall: Professor McGonagall\n",
      "\n",
      "                        MATCH (a:`Minerva McGonagall` {name: \"Minerva McGonagall\"}) set a.name = \"Professor McGonagall\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging Professor McGonagall: Professor McGonagall and Professor McGonagall: Minerva McGonagall\n",
      "\n",
      "                        MATCH (a:`Professor McGonagall` {name: \"Professor McGonagall\"}), (b:`Professor McGonagall` {name: \"Minerva McGonagall\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "2/41\n",
      "Merging Person: Lily and Person: Lily\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Lily\"}), (b:`Person` {name: \"Lily\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Lily and Person: Lily Potter\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Lily\"}), (b:`Person` {name: \"Lily Potter\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Lily Potter to MagicalCreature: Lily\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Lily Potter\"}) set a.name = \"Lily\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "3/41\n",
      "Merging Person: Professor Dumbledore and Person: Professor Dumbledore\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Dumbledore\"}), (b:`Person` {name: \"Professor Dumbledore\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Professor Dumbledore: Professor Dumbledore and Professor Dumbledore: Professor Dumbledore\n",
      "\n",
      "                        MATCH (a:`Professor Dumbledore` {name: \"Professor Dumbledore\"}), (b:`Professor Dumbledore` {name: \"Professor Dumbledore\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Dumbledore and Person: Dumbledore\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Dumbledore\"}), (b:`Person` {name: \"Dumbledore\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Dumbledore to MagicalCreature: Professor Dumbledore\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Dumbledore\"}) set a.name = \"Professor Dumbledore\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Dumbledore: Dumbledore to Dumbledore: Professor Dumbledore\n",
      "\n",
      "                        MATCH (a:`Dumbledore` {name: \"Dumbledore\"}) set a.name = \"Professor Dumbledore\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Albus Dumbledore to Person: Professor Dumbledore\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Albus Dumbledore\"}) set a.name = \"Professor Dumbledore\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "Merging Dumbledore: Professor Dumbledore and Dumbledore: Albus Dumbledore\n",
      "\n",
      "                        MATCH (a:`Dumbledore` {name: \"Professor Dumbledore\"}), (b:`Dumbledore` {name: \"Albus Dumbledore\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "4/41\n",
      "Merging Person: Hagrid and Person: Rubeus Hagrid\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Hagrid\"}), (b:`Person` {name: \"Rubeus Hagrid\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "Merging Hagrid: Hagrid and Hagrid: Rubeus Hagrid\n",
      "\n",
      "                        MATCH (a:`Hagrid` {name: \"Hagrid\"}), (b:`Hagrid` {name: \"Rubeus Hagrid\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging MagicalCreature: Hagrid and MagicalCreature: Hagrid\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Hagrid\"}), (b:`MagicalCreature` {name: \"Hagrid\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "5/41\n",
      "Merging Person: James Potter and Person: James Potter\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"James Potter\"}), (b:`Person` {name: \"James Potter\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: James Potter and MagicalCreature: James Potter\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"James Potter\"}), (b:`MagicalCreature` {name: \"James Potter\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging James: James Potter and James: James Potter\n",
      "\n",
      "                        MATCH (a:`James` {name: \"James Potter\"}), (b:`James` {name: \"James Potter\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "6/41\n",
      "Merging Person: Harry Potter and Person: Harry\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Harry Potter\"}), (b:`Person` {name: \"Harry\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Object: Harry to Object: Harry Potter\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Harry\"}) set a.name = \"Harry Potter\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging Harry Potter: Harry Potter and Harry Potter: Harry\n",
      "\n",
      "                        MATCH (a:`Harry Potter` {name: \"Harry Potter\"}), (b:`Harry Potter` {name: \"Harry\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Harry: Harry Potter and Harry: Harry\n",
      "\n",
      "                        MATCH (a:`Harry` {name: \"Harry Potter\"}), (b:`Harry` {name: \"Harry\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging MagicalCreature: Harry Potter and MagicalCreature: Harry Potter\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Harry Potter\"}), (b:`MagicalCreature` {name: \"Harry Potter\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Object: Harry Potter and Object: Harry Potter\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Harry Potter\"}), (b:`Object` {name: \"Harry Potter\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Boy: Harry Potter and Boy: Harry Potter\n",
      "\n",
      "                        MATCH (a:`Boy` {name: \"Harry Potter\"}), (b:`Boy` {name: \"Harry Potter\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "7/41\n",
      "Merging Person: Dudley Dursley and Person: Dudley Dursley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Dudley Dursley\"}), (b:`Person` {name: \"Dudley Dursley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Dudley: Dudley Dursley and Dudley: Dudley Dursley\n",
      "\n",
      "                        MATCH (a:`Dudley` {name: \"Dudley Dursley\"}), (b:`Dudley` {name: \"Dudley Dursley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Dudley Dursley: Dudley Dursley and Dudley Dursley: Dudley Dursley\n",
      "\n",
      "                        MATCH (a:`Dudley Dursley` {name: \"Dudley Dursley\"}), (b:`Dudley Dursley` {name: \"Dudley Dursley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Dudley Dursley and Person: Dudley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Dudley Dursley\"}), (b:`Person` {name: \"Dudley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Dudley to MagicalCreature: Dudley Dursley\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Dudley\"}) set a.name = \"Dudley Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging Dudley: Dudley Dursley and Dudley: Dudley\n",
      "\n",
      "                        MATCH (a:`Dudley` {name: \"Dudley Dursley\"}), (b:`Dudley` {name: \"Dudley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "8/41\n",
      "Merging Person: Vernon Dursley and Person: Dursley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Vernon Dursley\"}), (b:`Person` {name: \"Dursley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Mr Dursley to Person: Vernon Dursley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Mr Dursley\"}) set a.name = \"Vernon Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Vernon Dursley and Person: Uncle Vernon\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Vernon Dursley\"}), (b:`Person` {name: \"Uncle Vernon\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Uncle Vernon: Vernon Dursley and Uncle Vernon: Uncle Vernon\n",
      "\n",
      "                        MATCH (a:`Uncle Vernon` {name: \"Vernon Dursley\"}), (b:`Uncle Vernon` {name: \"Uncle Vernon\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename Uncle Vernon Dursley: Uncle Vernon to Uncle Vernon Dursley: Vernon Dursley\n",
      "\n",
      "                        MATCH (a:`Uncle Vernon Dursley` {name: \"Uncle Vernon\"}) set a.name = \"Vernon Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "9/41\n",
      "=========================================\n",
      "=========================================\n",
      "rename Person: Dursleys to Person: Mr and Mrs Dursley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Dursleys\"}) set a.name = \"Mr and Mrs Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Organisation: Dursleys to Organisation: Mr and Mrs Dursley\n",
      "\n",
      "                        MATCH (a:`Organisation` {name: \"Dursleys\"}) set a.name = \"Mr and Mrs Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Dursleys: Dursleys to Dursleys: Mr and Mrs Dursley\n",
      "\n",
      "                        MATCH (a:`Dursleys` {name: \"Dursleys\"}) set a.name = \"Mr and Mrs Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Muggle: Dursleys to Muggle: Mr and Mrs Dursley\n",
      "\n",
      "                        MATCH (a:`Muggle` {name: \"Dursleys\"}) set a.name = \"Mr and Mrs Dursley\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "10/41\n",
      "Merging Person: Cloaked figure and Person: Cloaked figure\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Cloaked figure\"}), (b:`Person` {name: \"Cloaked figure\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "11/41\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "Merging Hermione Granger: Hermione Granger and Hermione Granger: Hermione Jean Granger\n",
      "\n",
      "                        MATCH (a:`Hermione Granger` {name: \"Hermione Granger\"}), (b:`Hermione Granger` {name: \"Hermione Jean Granger\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Hermione Granger and Person: Hermione Granger\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Hermione Granger\"}), (b:`Person` {name: \"Hermione Granger\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Hermione Granger and MagicalCreature: Hermione Granger\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Hermione Granger\"}), (b:`MagicalCreature` {name: \"Hermione Granger\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Hermione: Hermione Granger and Hermione: Hermione Granger\n",
      "\n",
      "                        MATCH (a:`Hermione` {name: \"Hermione Granger\"}), (b:`Hermione` {name: \"Hermione Granger\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Hermione Granger and Person: Hermione\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Hermione Granger\"}), (b:`Person` {name: \"Hermione\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Hermione Granger and MagicalCreature: Hermione\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Hermione Granger\"}), (b:`MagicalCreature` {name: \"Hermione\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename Object: Hermione to Object: Hermione Granger\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Hermione\"}) set a.name = \"Hermione Granger\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Hermione Granger: Hermione to Hermione Granger: Hermione Granger\n",
      "\n",
      "                        MATCH (a:`Hermione Granger` {name: \"Hermione\"}) set a.name = \"Hermione Granger\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging Hermione: Hermione Granger and Hermione: Hermione\n",
      "\n",
      "                        MATCH (a:`Hermione` {name: \"Hermione Granger\"}), (b:`Hermione` {name: \"Hermione\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename Mudblood: Hermione to Mudblood: Hermione Granger\n",
      "\n",
      "                        MATCH (a:`Mudblood` {name: \"Hermione\"}) set a.name = \"Hermione Granger\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "12/41\n",
      "Merging Person: Ron Weasley and Person: Ron Weasley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Ron Weasley\"}), (b:`Person` {name: \"Ron Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Ron Weasley and MagicalCreature: Ron Weasley\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Ron Weasley\"}), (b:`MagicalCreature` {name: \"Ron Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Ron Weasley: Ron Weasley and Ron Weasley: Ron Weasley\n",
      "\n",
      "                        MATCH (a:`Ron Weasley` {name: \"Ron Weasley\"}), (b:`Ron Weasley` {name: \"Ron Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Ron: Ron Weasley and Ron: Ron Weasley\n",
      "\n",
      "                        MATCH (a:`Ron` {name: \"Ron Weasley\"}), (b:`Ron` {name: \"Ron Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Ron Weasley and Person: Ron\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Ron Weasley\"}), (b:`Person` {name: \"Ron\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Ron Weasley and MagicalCreature: Ron\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Ron Weasley\"}), (b:`MagicalCreature` {name: \"Ron\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Ron Weasley: Ron Weasley and Ron Weasley: Ron\n",
      "\n",
      "                        MATCH (a:`Ron Weasley` {name: \"Ron Weasley\"}), (b:`Ron Weasley` {name: \"Ron\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Ron: Ron Weasley and Ron: Ron\n",
      "\n",
      "                        MATCH (a:`Ron` {name: \"Ron Weasley\"}), (b:`Ron` {name: \"Ron\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Ron Weasley: Ronald Bilius Weasley to Ron Weasley: Ron Weasley\n",
      "\n",
      "                        MATCH (a:`Ron Weasley` {name: \"Ronald Bilius Weasley\"}) set a.name = \"Ron Weasley\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "13/41\n",
      "rename Person: Scabbers to Person: Scabbers/Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Scabbers\"}) set a.name = \"Scabbers/Peter Pettigrew\"\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Scabbers to MagicalCreature: Scabbers/Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Scabbers\"}) set a.name = \"Scabbers/Peter Pettigrew\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Object: Scabbers to Object: Scabbers/Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Scabbers\"}) set a.name = \"Scabbers/Peter Pettigrew\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Animal: Scabbers to Animal: Scabbers/Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`Animal` {name: \"Scabbers\"}) set a.name = \"Scabbers/Peter Pettigrew\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Scabbers: Scabbers to Scabbers: Scabbers/Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`Scabbers` {name: \"Scabbers\"}) set a.name = \"Scabbers/Peter Pettigrew\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Scabbers/Peter Pettigrew and Person: Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Scabbers/Peter Pettigrew\"}), (b:`Person` {name: \"Peter Pettigrew\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Scabbers/Peter Pettigrew and MagicalCreature: Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Scabbers/Peter Pettigrew\"}), (b:`MagicalCreature` {name: \"Peter Pettigrew\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Pettigrew: Peter Pettigrew to Pettigrew: Scabbers/Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`Pettigrew` {name: \"Peter Pettigrew\"}) set a.name = \"Scabbers/Peter Pettigrew\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Wormtail: Peter Pettigrew to Wormtail: Scabbers/Peter Pettigrew\n",
      "\n",
      "                        MATCH (a:`Wormtail` {name: \"Peter Pettigrew\"}) set a.name = \"Scabbers/Peter Pettigrew\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "14/41\n",
      "Merging Person: Draco Malfoy and Person: Draco Malfoy\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Draco Malfoy\"}), (b:`Person` {name: \"Draco Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Draco Malfoy and MagicalCreature: Draco Malfoy\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Draco Malfoy\"}), (b:`MagicalCreature` {name: \"Draco Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Malfoy: Draco Malfoy and Malfoy: Draco Malfoy\n",
      "\n",
      "                        MATCH (a:`Malfoy` {name: \"Draco Malfoy\"}), (b:`Malfoy` {name: \"Draco Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Draco Malfoy and Person: Malfoy\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Draco Malfoy\"}), (b:`Person` {name: \"Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Draco Malfoy and MagicalCreature: Malfoy\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Draco Malfoy\"}), (b:`MagicalCreature` {name: \"Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "15/41\n",
      "Merging Person: Vincent Crabbe and Person: Crabbe\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Vincent Crabbe\"}), (b:`Person` {name: \"Crabbe\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Crabbe to MagicalCreature: Vincent Crabbe\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Crabbe\"}) set a.name = \"Vincent Crabbe\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging MagicalCreature: Vincent Crabbe and MagicalCreature: Vincent Crabbe\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Vincent Crabbe\"}), (b:`MagicalCreature` {name: \"Vincent Crabbe\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "16/41\n",
      "Merging Person: Gregory Goyle and Person: Gregory Goyle\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Gregory Goyle\"}), (b:`Person` {name: \"Gregory Goyle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Gregory Goyle and Person: Goyle\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Gregory Goyle\"}), (b:`Person` {name: \"Goyle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Goyle to MagicalCreature: Gregory Goyle\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Goyle\"}) set a.name = \"Gregory Goyle\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "17/41\n",
      "Merging Person: Lucius Malfoy and Person: Lucius Malfoy\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Lucius Malfoy\"}), (b:`Person` {name: \"Lucius Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Lucius Malfoy: Lucius Malfoy and Lucius Malfoy: Lucius Malfoy\n",
      "\n",
      "                        MATCH (a:`Lucius Malfoy` {name: \"Lucius Malfoy\"}), (b:`Lucius Malfoy` {name: \"Lucius Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Lucius Malfoy and Person: Malfoy\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Lucius Malfoy\"}), (b:`Person` {name: \"Malfoy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Malfoy to MagicalCreature: Lucius Malfoy\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Malfoy\"}) set a.name = \"Lucius Malfoy\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Mr Malfoy to Person: Lucius Malfoy\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Mr Malfoy\"}) set a.name = \"Lucius Malfoy\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "18/41\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Justin Finch Fletchley and Person: Justin\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Justin Finch Fletchley\"}), (b:`Person` {name: \"Justin\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "19/41\n",
      "Merging Person: Professor Lupin and Person: Professor Lupin\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Lupin\"}), (b:`Person` {name: \"Professor Lupin\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Professor Lupin: Professor Lupin and Professor Lupin: Professor Lupin\n",
      "\n",
      "                        MATCH (a:`Professor Lupin` {name: \"Professor Lupin\"}), (b:`Professor Lupin` {name: \"Professor Lupin\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Defense Against the Dark Arts teacher: Professor Lupin and Defense Against the Dark Arts teacher: Professor Lupin\n",
      "\n",
      "                        MATCH (a:`Defense Against the Dark Arts teacher` {name: \"Professor Lupin\"}), (b:`Defense Against the Dark Arts teacher` {name: \"Professor Lupin\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Lupin and Person: Lupin\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Lupin\"}), (b:`Person` {name: \"Lupin\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Lupin to MagicalCreature: Professor Lupin\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Lupin\"}) set a.name = \"Professor Lupin\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Lupin: Lupin to Lupin: Professor Lupin\n",
      "\n",
      "                        MATCH (a:`Lupin` {name: \"Lupin\"}) set a.name = \"Professor Lupin\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Remus John Lupin to Person: Professor Lupin\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Remus John Lupin\"}) set a.name = \"Professor Lupin\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "20/41\n",
      "Merging Person: Sirius Black and Person: Sirius Black\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Sirius Black\"}), (b:`Person` {name: \"Sirius Black\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Sirius Black and MagicalCreature: Sirius Black\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Sirius Black\"}), (b:`MagicalCreature` {name: \"Sirius Black\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Sirius: Sirius Black and Sirius: Sirius Black\n",
      "\n",
      "                        MATCH (a:`Sirius` {name: \"Sirius Black\"}), (b:`Sirius` {name: \"Sirius Black\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Sirius Black: Sirius Black and Sirius Black: Sirius Black\n",
      "\n",
      "                        MATCH (a:`Sirius Black` {name: \"Sirius Black\"}), (b:`Sirius Black` {name: \"Sirius Black\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Sirius Black and Person: Black\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Sirius Black\"}), (b:`Person` {name: \"Black\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Black: Black to Black: Sirius Black\n",
      "\n",
      "                        MATCH (a:`Black` {name: \"Black\"}) set a.name = \"Sirius Black\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "21/41\n",
      "Merging Person: Professor Filch and Person: Argus Filch\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Filch\"}), (b:`Person` {name: \"Argus Filch\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Filch to Person: Professor Filch\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Filch\"}) set a.name = \"Professor Filch\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Filch and Person: Professor Filch\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Filch\"}), (b:`Person` {name: \"Professor Filch\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "22/41\n",
      "Merging Person: Professor Snape and Person: Severus Snape\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Snape\"}), (b:`Person` {name: \"Severus Snape\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Snape: Professor Snape and Snape: Severus Snape\n",
      "\n",
      "                        MATCH (a:`Snape` {name: \"Professor Snape\"}), (b:`Snape` {name: \"Severus Snape\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Snape to Person: Professor Snape\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Snape\"}) set a.name = \"Professor Snape\"\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Snape to MagicalCreature: Professor Snape\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Snape\"}) set a.name = \"Professor Snape\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Object: Snape to Object: Professor Snape\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Snape\"}) set a.name = \"Professor Snape\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Snape: Snape to Snape: Professor Snape\n",
      "\n",
      "                        MATCH (a:`Snape` {name: \"Snape\"}) set a.name = \"Professor Snape\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Snape and Person: Professor Snape\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Snape\"}), (b:`Person` {name: \"Professor Snape\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Professor Snape and MagicalCreature: Professor Snape\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Professor Snape\"}), (b:`MagicalCreature` {name: \"Professor Snape\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Object: Professor Snape and Object: Professor Snape\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Professor Snape\"}), (b:`Object` {name: \"Professor Snape\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Snape: Professor Snape and Snape: Professor Snape\n",
      "\n",
      "                        MATCH (a:`Snape` {name: \"Professor Snape\"}), (b:`Snape` {name: \"Professor Snape\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "23/41\n",
      "Merging Person: Professor Flitwick and Person: Filius Flitwick\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Flitwick\"}), (b:`Person` {name: \"Filius Flitwick\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Flitwick to Person: Professor Flitwick\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Flitwick\"}) set a.name = \"Professor Flitwick\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Flitwick and Person: Professor Flitwick\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Flitwick\"}), (b:`Person` {name: \"Professor Flitwick\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "24/41\n",
      "Merging Person: Professor Slughorn and Person: Horace Slughorn\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Slughorn\"}), (b:`Person` {name: \"Horace Slughorn\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Slughorn: Professor Slughorn and Slughorn: Professor Slughorn\n",
      "\n",
      "                        MATCH (a:`Slughorn` {name: \"Professor Slughorn\"}), (b:`Slughorn` {name: \"Professor Slughorn\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "25/41\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Sprout and Person: Professor Sprout\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Sprout\"}), (b:`Person` {name: \"Professor Sprout\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "26/41\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Quirrell and Person: Professor Quirrell\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Quirrell\"}), (b:`Person` {name: \"Professor Quirrell\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "27/41\n",
      "Merging Person: Professor Trelawney and Person: Sybill Trelawney\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Trelawney\"}), (b:`Person` {name: \"Sybill Trelawney\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "=========================================\n",
      "28/41\n",
      "Merging Person: Professor Moody and Person: Professor Moody\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Moody\"}), (b:`Person` {name: \"Professor Moody\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Moody and Person: Moody\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Moody\"}), (b:`Person` {name: \"Moody\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Moody to MagicalCreature: Professor Moody\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Moody\"}) set a.name = \"Professor Moody\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Alastor Moody: Moody to Alastor Moody: Professor Moody\n",
      "\n",
      "                        MATCH (a:`Alastor Moody` {name: \"Moody\"}) set a.name = \"Professor Moody\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Alastor Moody to Person: Professor Moody\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Alastor Moody\"}) set a.name = \"Professor Moody\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Moody: Alastor Moody to Moody: Professor Moody\n",
      "\n",
      "                        MATCH (a:`Moody` {name: \"Alastor Moody\"}) set a.name = \"Professor Moody\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "29/41\n",
      "Merging Person: Professor Lockhart and Person: Gilderoy Lockhart\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Lockhart\"}), (b:`Person` {name: \"Gilderoy Lockhart\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Gilderoy Lockhart to MagicalCreature: Professor Lockhart\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Gilderoy Lockhart\"}) set a.name = \"Professor Lockhart\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Lockhart to Person: Professor Lockhart\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Lockhart\"}) set a.name = \"Professor Lockhart\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Professor Lockhart and MagicalCreature: Lockhart\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Professor Lockhart\"}), (b:`MagicalCreature` {name: \"Lockhart\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Professor Lockhart and Person: Professor Lockhart\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Professor Lockhart\"}), (b:`Person` {name: \"Professor Lockhart\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "30/41\n",
      "Merging Person: Percy Weasley and Person: Percy\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Percy Weasley\"}), (b:`Person` {name: \"Percy\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "=========================================\n",
      "31/41\n",
      "Merging Person: Hannah Abbott and Person: Hannah Abbott\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Hannah Abbott\"}), (b:`Person` {name: \"Hannah Abbott\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Hannah Abbott and Person: Hannah\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Hannah Abbott\"}), (b:`Person` {name: \"Hannah\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "32/41\n",
      "Merging Person: Arthur Weasley and Person: Mr Weasley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Arthur Weasley\"}), (b:`Person` {name: \"Mr Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Arthur Weasley and MagicalCreature: Mr Weasley\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Arthur Weasley\"}), (b:`MagicalCreature` {name: \"Mr Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename Mr Weasley: Mr Weasley to Mr Weasley: Arthur Weasley\n",
      "\n",
      "                        MATCH (a:`Mr Weasley` {name: \"Mr Weasley\"}) set a.name = \"Arthur Weasley\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Arthur Weasley: Mr Weasley to Arthur Weasley: Arthur Weasley\n",
      "\n",
      "                        MATCH (a:`Arthur Weasley` {name: \"Mr Weasley\"}) set a.name = \"Arthur Weasley\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Mr Weasley: Arthur Weasley and Mr Weasley: Arthur Weasley\n",
      "\n",
      "                        MATCH (a:`Mr Weasley` {name: \"Arthur Weasley\"}), (b:`Mr Weasley` {name: \"Arthur Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Arthur Weasley: Arthur Weasley and Arthur Weasley: Arthur Weasley\n",
      "\n",
      "                        MATCH (a:`Arthur Weasley` {name: \"Arthur Weasley\"}), (b:`Arthur Weasley` {name: \"Arthur Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "33/41\n",
      "Merging Person: Molly Weasley and Person: Mrs Weasley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Molly Weasley\"}), (b:`Person` {name: \"Mrs Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Mrs Weasley: Molly Weasley and Mrs Weasley: Molly Weasley\n",
      "\n",
      "                        MATCH (a:`Mrs Weasley` {name: \"Molly Weasley\"}), (b:`Mrs Weasley` {name: \"Molly Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "34/41\n",
      "Merging Person: Fred Weasley and Person: Fred Weasley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Fred Weasley\"}), (b:`Person` {name: \"Fred Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Fred: Fred Weasley and Fred: Fred Weasley\n",
      "\n",
      "                        MATCH (a:`Fred` {name: \"Fred Weasley\"}), (b:`Fred` {name: \"Fred Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Fred Weasley and Person: Fred\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Fred Weasley\"}), (b:`Person` {name: \"Fred\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Fred to MagicalCreature: Fred Weasley\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Fred\"}) set a.name = \"Fred Weasley\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Fred Weasley: Fred to Fred Weasley: Fred Weasley\n",
      "\n",
      "                        MATCH (a:`Fred Weasley` {name: \"Fred\"}) set a.name = \"Fred Weasley\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "35/41\n",
      "Merging Person: George Weasley and Person: George Weasley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"George Weasley\"}), (b:`Person` {name: \"George Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging George Weasley: George Weasley and George Weasley: George Weasley\n",
      "\n",
      "                        MATCH (a:`George Weasley` {name: \"George Weasley\"}), (b:`George Weasley` {name: \"George Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging George: George Weasley and George: George Weasley\n",
      "\n",
      "                        MATCH (a:`George` {name: \"George Weasley\"}), (b:`George` {name: \"George Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: George Weasley and Person: George\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"George Weasley\"}), (b:`Person` {name: \"George\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "36/41\n",
      "rename Person: Tom Riddle to Person: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Tom Riddle\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Tom Riddle to MagicalCreature: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Tom Riddle\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Voldemort: Tom Riddle to Voldemort: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Voldemort` {name: \"Tom Riddle\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Tom Riddle/Voldemort and Person: Riddle\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Tom Riddle/Voldemort\"}), (b:`Person` {name: \"Riddle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Lord Voldemort: Tom Marvolo Riddle to Lord Voldemort: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Lord Voldemort` {name: \"Tom Marvolo Riddle\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging Voldemort: Tom Riddle/Voldemort and Voldemort: Tom Marvolo Riddle\n",
      "\n",
      "                        MATCH (a:`Voldemort` {name: \"Tom Riddle/Voldemort\"}), (b:`Voldemort` {name: \"Tom Marvolo Riddle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Lord Voldemort to Person: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Lord Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Tom Riddle/Voldemort and MagicalCreature: Lord Voldemort\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Tom Riddle/Voldemort\"}), (b:`MagicalCreature` {name: \"Lord Voldemort\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Lord Voldemort: Tom Riddle/Voldemort and Lord Voldemort: Lord Voldemort\n",
      "\n",
      "                        MATCH (a:`Lord Voldemort` {name: \"Tom Riddle/Voldemort\"}), (b:`Lord Voldemort` {name: \"Lord Voldemort\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename Voldemort: Lord Voldemort to Voldemort: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Voldemort` {name: \"Lord Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Dark wizard: Lord Voldemort to Dark wizard: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Dark wizard` {name: \"Lord Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Dark Lord (Voldemort): Lord Voldemort to Dark Lord (Voldemort): Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Dark Lord (Voldemort)` {name: \"Lord Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Dark Lord: Lord Voldemort to Dark Lord: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Dark Lord` {name: \"Lord Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Tom Riddle/Voldemort and Person: Voldemort\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Tom Riddle/Voldemort\"}), (b:`Person` {name: \"Voldemort\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "rename MagicalCreature: Voldemort to MagicalCreature: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Object: Voldemort to Object: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "rename Lord Voldemort: Voldemort to Lord Voldemort: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Lord Voldemort` {name: \"Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "rename Magical Creature: Voldemort to Magical Creature: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Magical Creature` {name: \"Voldemort\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "rename Person: Dark Lord to Person: Tom Riddle/Voldemort\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Dark Lord\"}) set a.name = \"Tom Riddle/Voldemort\"\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Tom Riddle/Voldemort and MagicalCreature: Dark Lord\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Tom Riddle/Voldemort\"}), (b:`MagicalCreature` {name: \"Dark Lord\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "37/41\n",
      "Merging Person: Ginny Weasley and Person: Ginny\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Ginny Weasley\"}), (b:`Person` {name: \"Ginny\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "Merging Ginny Weasley: Ginny Weasley and Ginny Weasley: Ginny\n",
      "\n",
      "                        MATCH (a:`Ginny Weasley` {name: \"Ginny Weasley\"}), (b:`Ginny Weasley` {name: \"Ginny\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Ginny: Ginny Weasley and Ginny: Ginny Weasley\n",
      "\n",
      "                        MATCH (a:`Ginny` {name: \"Ginny Weasley\"}), (b:`Ginny` {name: \"Ginny Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "38/41\n",
      "rename Person: Percy to Person: Percy Weasley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Percy\"}) set a.name = \"Percy Weasley\"\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Percy Weasley and Person: Percy Weasley\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Percy Weasley\"}), (b:`Person` {name: \"Percy Weasley\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "39/41\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Gryffindor and Person: Gryffindor\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Gryffindor\"}), (b:`Person` {name: \"Gryffindor\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Organisation: Gryffindor and Organisation: Gryffindor\n",
      "\n",
      "                        MATCH (a:`Organisation` {name: \"Gryffindor\"}), (b:`Organisation` {name: \"Gryffindor\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging House: Gryffindor and House: Gryffindor\n",
      "\n",
      "                        MATCH (a:`House` {name: \"Gryffindor\"}), (b:`House` {name: \"Gryffindor\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging QuidditchTeam: Gryffindor and QuidditchTeam: Gryffindor\n",
      "\n",
      "                        MATCH (a:`QuidditchTeam` {name: \"Gryffindor\"}), (b:`QuidditchTeam` {name: \"Gryffindor\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Team: Gryffindor and Team: Gryffindor\n",
      "\n",
      "                        MATCH (a:`Team` {name: \"Gryffindor\"}), (b:`Team` {name: \"Gryffindor\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "40/41\n",
      "Merging Person: Oliver Wood and Person: Oliver Wood\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Oliver Wood\"}), (b:`Person` {name: \"Oliver Wood\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Oliver Wood and Person: Wood\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Oliver Wood\"}), (b:`Person` {name: \"Wood\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "41/41\n",
      "Merging Person: Moaning Myrtle and Person: Moaning Myrtle\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Moaning Myrtle\"}), (b:`Person` {name: \"Moaning Myrtle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging MagicalCreature: Moaning Myrtle and MagicalCreature: Moaning Myrtle\n",
      "\n",
      "                        MATCH (a:`MagicalCreature` {name: \"Moaning Myrtle\"}), (b:`MagicalCreature` {name: \"Moaning Myrtle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "Merging Object: Moaning Myrtle and Object: Moaning Myrtle\n",
      "\n",
      "                        MATCH (a:`Object` {name: \"Moaning Myrtle\"}), (b:`Object` {name: \"Moaning Myrtle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "=========================================\n",
      "Merging Person: Moaning Myrtle and Person: Myrtle\n",
      "\n",
      "                        MATCH (a:`Person` {name: \"Moaning Myrtle\"}), (b:`Person` {name: \"Myrtle\"})\n",
      "                        CALL apoc.refactor.mergeNodes([a, b], {properties: \"overwrite\", mergeRels: true}) YIELD node\n",
      "                        RETURN node\n",
      "                        \n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "未匹配到！\n",
      "*****************************************\n",
      "=========================================\n",
      "对齐实体完成！\n"
     ]
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "1624425e840488a0"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "31afa932912d8656"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "5e56e8da5f1fa2cc"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
